    Pandas, Python programlama dili için yüksek performanslı, kullanımı kolay veri yapıları ve veri analizi araçları sağlayan, açık kaynaklı, BSD lisanslı bir kütüphanedir.
    Proje ana sayfası: https://pandas.pydata.org/

In [1]:
import pandas as pd

# Pandas ile Veri Okuma

In [2]:
# Okuyacağımız veriyi çalışma diznine taşırsak sadece veri dosyası ismi kullanmak yeterlidir.
# Bulunduğumuz çalışma diznini aşağıdaki kodlarla öğrenebiliriz.
import os
os.getcwd()

'D:\\OneDrive\\egitim\\verilen\\BlueMarkAcademy\\Tarim_Kredi_Kooperatifleri_Merkez_Birligi\\preprocessing-analysis-ml-dl-big-data\\02_pandas'

In [24]:
# VEri setini çalışma diznine taşımamış isek path belirtmek gerekir. 
# Ayrıca veri ayracının ne olduğu ve encodingin ne olduğuna da dikkat etmek gerekir (utf-8)
# Encoding Notepad++ üzerinden Encoding -> Convert to UTF8 veya notepad ile farklı kaydetme esnasında değiştirilebilir.

df = pd.read_csv("D:/Datasets/Mall_Customers.csv", sep=",")

In [25]:
df.head(10)

   CustomerID  Gender  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                  15                      39
1           2    Male   21                  15                      81
2           3  Female   20                  16                       6
3           4  Female   23                  16                      77
4           5  Female   31                  17                      40
5           6  Female   22                  17                      76
6           7  Female   35                  18                       6
7           8  Female   23                  18                      94
8           9    Male   64                  19                       3
9          10  Female   30                  19                      72

# Pandas Dataframe Şekli, Boyutu

In [26]:
df.shape

(200, 5)

In [27]:
# Yukarıdaki bilgiden 15 satır 6 sütundan oluştuğunu anlıyoruz.

# Dataframe hakkında daha detaylı bilgi

In [28]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 5 columns):
CustomerID                200 non-null int64
Gender                    200 non-null object
Age                       200 non-null int64
Annual Income (k$)        200 non-null int64
Spending Score (1-100)    200 non-null int64
dtypes: int64(4), object(1)
memory usage: 7.9+ KB

In [29]:
df.describe()

       CustomerID         Age  Annual Income (k$)  Spending Score (1-100)
count  200.000000  200.000000          200.000000              200.000000
mean   100.500000   38.850000           60.560000               50.200000
std     57.879185   13.969007           26.264721               25.823522
min      1.000000   18.000000           15.000000                1.000000
25%     50.750000   28.750000           41.500000               34.750000
50%    100.500000   36.000000           61.500000               50.000000
75%    150.250000   49.000000           78.000000               73.000000
max    200.000000   70.000000          137.000000               99.000000

# Okurken sütun seçmek, sep ve header

In [30]:
# sep="," niteliklerin birbirinden virgülile ayrılacaını söyler. Varsayılan virgüldür.
# Farklı bir ayraç için mutlaka bu parametre kullanılmalıdır.

In [31]:
df2 = pd.read_csv("D:/Datasets/Mall_Customers.csv",
                sep=",",
                header=0,
                usecols=["Gender","Age"])

In [32]:
df2.head()

   Gender  Age
0    Male   19
1    Male   21
2  Female   20
3  Female   23
4  Female   31

# Sütun İsimlerini Değiştirmek

In [33]:
df.columns

Index(['CustomerID', 'Gender', 'Age', 'Annual Income (k$)',
       'Spending Score (1-100)'],
      dtype='object')

In [34]:
new_col_names = ['CustomerID', 'Gender', 'Age', 'AnnualIncome','SpendingScore']
df.columns = new_col_names
df.head()

   CustomerID  Gender  Age  AnnualIncome  SpendingScore
0           1    Male   19            15             39
1           2    Male   21            15             81
2           3  Female   20            16              6
3           4  Female   23            16             77
4           5  Female   31            17             40

# Sütunları Seçmek

In [35]:
df['SpendingScore'].head()

0    39
1    81
2     6
3    77
4    40
Name: SpendingScore, dtype: int64

In [36]:
df.SpendingScore.head()

0    39
1    81
2     6
3    77
4    40
Name: SpendingScore, dtype: int64

#  Birden fazla sütunu seçmek (liste içinde seçmeyi unutmayın!!!)

In [37]:
df[['AnnualIncome','SpendingScore']].head()

   AnnualIncome  SpendingScore
0            15             39
1            15             81
2            16              6
3            16             77
4            17             40

# Mevcut Bir Sutünun Değerlerini Değiştirmek

In [38]:
df['AnnualIncome'] = df.AnnualIncome * 1000

In [39]:
df.head()

   CustomerID  Gender  Age  AnnualIncome  SpendingScore
0           1    Male   19         15000             39
1           2    Male   21         15000             81
2           3  Female   20         16000              6
3           4  Female   23         16000             77
4           5  Female   31         17000             40

# Yeni Sütun Eklemek

In [40]:
df['AnnualIncomeTL'] = df.AnnualIncome * 5.5

In [41]:
df.head()

   CustomerID  Gender  Age  AnnualIncome  SpendingScore  AnnualIncomeTL
0           1    Male   19         15000             39         82500.0
1           2    Male   21         15000             81         82500.0
2           3  Female   20         16000              6         88000.0
3           4  Female   23         16000             77         88000.0
4           5  Female   31         17000             40         93500.0

In [42]:
df.shape

(200, 6)

# Kategorik Değişken Üreterek Yeni Sütun Yaratmak

In [47]:
# Yıllık 40K'dan küçükse low, 40K-100K arası low, 100K üzeri high olsun

op_labels = ['low', 'middle', 'high']
category = [0,40000,100000,150000]
df['IncomeCat'] = pd.cut(df['AnnualIncome'], labels=op_labels, bins=category, include_lowest=False)

In [49]:
df.head()

,CustomerID,Gender,Age,AnnualIncome,SpendingScore,AnnualIncomeTL,IncomeCat
0,1,Male,19,15000,39,82500.0,low
1,2,Male,21,15000,81,82500.0,low
2,3,Female,20,16000,6,88000.0,low
3,4,Female,23,16000,77,88000.0,low
4,5,Female,31,17000,40,93500.0,low

# Sütunları Birleştirmek

In [50]:
df['Ann-IncomeCat'] = df['AnnualIncome'] + ' - ' + df['IncomeCat']

TypeError: ufunc 'add' did not contain a loop with signature matching types dtype('<U21') dtype('<U21') dtype('<U21')

In [54]:
# int ile string birleşmez.
df['Ann-IncomeCat'] = df['AnnualIncome'].astype(str) + ' - ' + df['IncomeCat'].astype(str)

In [55]:
df.head()

,CustomerID,Gender,Age,AnnualIncome,SpendingScore,AnnualIncomeTL,IncomeCat,Ann-IncomeCat
0,1,Male,19,15000,39,82500.0,low,15000 - low
1,2,Male,21,15000,81,82500.0,low,15000 - low
2,3,Female,20,16000,6,88000.0,low,16000 - low
3,4,Female,23,16000,77,88000.0,low,16000 - low
4,5,Female,31,17000,40,93500.0,low,17000 - low

# Her satır için benzersiz bir id oluşturmak

In [56]:
# Kaç satır var?
df.count()

CustomerID        200
Gender            200
Age               200
AnnualIncome      200
SpendingScore     200
AnnualIncomeTL    200
IncomeCat         200
Ann-IncomeCat     200
dtype: int64

In [57]:
df['ID'] = range(0,200)
df.head()

,CustomerID,Gender,Age,AnnualIncome,SpendingScore,AnnualIncomeTL,IncomeCat,Ann-IncomeCat,ID
0,1,Male,19,15000,39,82500.0,low,15000 - low,0
1,2,Male,21,15000,81,82500.0,low,15000 - low,1
2,3,Female,20,16000,6,88000.0,low,16000 - low,2
3,4,Female,23,16000,77,88000.0,low,16000 - low,3
4,5,Female,31,17000,40,93500.0,low,17000 - low,4

# Sütunları Yeniden Adlandırmak

In [59]:
sutun_degisimi = {'ID':'ROWID'}
df.rename(columns=sutun_degisimi, inplace=True)
# inplace=True demek bu değişimi bellekte gerçekleştir.
# inplace=True işleminin geri dönüşü yoktur. Veriyi baştan okumak gerekir.

In [60]:
df.head()

,CustomerID,Gender,Age,AnnualIncome,SpendingScore,AnnualIncomeTL,IncomeCat,Ann-IncomeCat,ROWID
0,1,Male,19,15000,39,82500.0,low,15000 - low,0
1,2,Male,21,15000,81,82500.0,low,15000 - low,1
2,3,Female,20,16000,6,88000.0,low,16000 - low,2
3,4,Female,23,16000,77,88000.0,low,16000 - low,3
4,5,Female,31,17000,40,93500.0,low,17000 - low,4

# Sütunların Sırasını Değiştirmek

In [37]:
# ROWID'yi en başa almak istiyorum

In [61]:
df.columns

Index(['CustomerID', 'Gender', 'Age', 'AnnualIncome', 'SpendingScore',
       'AnnualIncomeTL', 'IncomeCat', 'Ann-IncomeCat', 'ROWID'],
      dtype='object')

In [62]:
df = df[['ROWID','CustomerID', 'Gender', 'Age', 'AnnualIncome', 'SpendingScore',
       'AnnualIncomeTL', 'IncomeCat', 'Ann-IncomeCat']]

In [63]:
df.head()

,ROWID,CustomerID,Gender,Age,AnnualIncome,SpendingScore,AnnualIncomeTL,IncomeCat,Ann-IncomeCat
0,0,1,Male,19,15000,39,82500.0,low,15000 - low
1,1,2,Male,21,15000,81,82500.0,low,15000 - low
2,2,3,Female,20,16000,6,88000.0,low,16000 - low
3,3,4,Female,23,16000,77,88000.0,low,16000 - low
4,4,5,Female,31,17000,40,93500.0,low,17000 - low

# Ödev

In [1]:
# simple_data.csv verisini kullanarak;

# 1. Sütun İsimlerini BÜYÜK HARFLİ yapınız
# 2. Yeni bir sütun içinde meslek,sehir sütunlarını aralarında çizgi olacak şekilde birleştiriniz.
# 3. aylik_gelir'i dolar cinsinden hesaplayarak aylik_gelir_dolar ismiyle yeni bir sütun ekleyiniz.
# 4. 3801'den başlayacak şekilde her bir satıra id numarası veriniz (yeni bir sütun içinde)
# 5. aylik_geliri baz alarak 0-2500 arasını düşük, 2500-7500 arasını orta ve 7500 üstünü yüksek olacak şekilde 
#    kategorilendirip gelir_kategori ismiyle yeni bir sütun olarak ekleyiniz.